
## Plan Result (proxmox)

[CI link](https://github.com/shimosyan/raspberry-pi-cluster/actions/runs/17354589432)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * proxmox_lxc.test[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # proxmox_lxc.test[0] will be created
  + resource "proxmox_lxc" "test" {
      + arch         = "arm64"
      + cmode        = "tty"
      + console      = true
      + cores        = 1
      + cpulimit     = 0
      + cpuunits     = 1024
      + current_node = (known after apply)
      + force        = true
      + hostname     = "test"
      + id           = (known after apply)
      + memory       = 128
      + nameserver   = "192.168.2.1"
      + onboot       = true
      + ostemplate   = "synology-nfs:vztmpl/ubuntu-jammy-arm64-default.tar.xz"
      + ostype       = "ubuntu"
      + password     = (sensitive value)
      + protection   = false
      + start        = true
      + swap         = 0
      + target_node  = "raspi-8gb-1"
      + tty          = 2
      + unprivileged = false
      + unused       = (known after apply)
      + vmid         = 199

      + network {
          + bridge   = "vmbr0"
          + firewall = true
          + gw       = "192.168.6.1"
          + hwaddr   = (known after apply)
          + id       = (known after apply)
          + ip       = "192.168.6.100/24"
          + name     = "eth0"
          + tag      = (known after apply)
          + trunks   = (known after apply)
          + type     = (known after apply)
        }

      + rootfs {
          + size    = "8G"
          + storage = "synology-nfs"
          + volume  = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":31,"Program":"tfcmt","SHA1":"4a110416b184b5aa895bc72251d8332f7b467143","Target":"proxmox","Vars":{},"WorkflowName":"terraform-pull-request"} -->